import Svg, { Path, Ellipse, Rect, G } from 'react-native-svg';

import React from 'react';

const CameraIcon = ({ color, width, height }) => {
  return (
    <Svg
      id="photo-camera"
      xmlns="http://www.w3.org/2000/svg"
      width={width}
      height={height}
      viewBox="0 0 52 45"
    >
      <G id="그룹_36" data-name="그룹 36" transform="translate(0 0)">
        <Path
          id="패스_61"
          data-name="패스 61"
          d="M45.029,42.488l-5.457-.029-5.229-7.8a1.729,1.729,0,0,0-1.429-.8H18.829a1.722,1.722,0,0,0-1.4.771l-5.4,7.829-5.057.029A7,7,0,0,0,0,49.459V72A7.049,7.049,0,0,0,6.971,79.03H45.029A7.049,7.049,0,0,0,52,72V49.459A7,7,0,0,0,45.029,42.488ZM48.572,72a3.61,3.61,0,0,1-3.543,3.6H6.972A3.61,3.61,0,0,1,3.429,72V49.459a3.561,3.561,0,0,1,3.543-3.543h5.971a1.722,1.722,0,0,0,1.4-.771l5.4-7.829H32l5.2,7.771a1.763,1.763,0,0,0,1.4.771l6.4.057a3.561,3.561,0,0,1,3.543,3.543V72h.029Z"
          transform="translate(0 -33.859)"
          fill="#ccc"
        />
        <Path
          id="패스_62"
          data-name="패스 62"
          d="M150.976,160.225a12.143,12.143,0,1,0,12.143,12.143A12.151,12.151,0,0,0,150.976,160.225Zm0,20.857a8.714,8.714,0,1,1,8.714-8.714A8.731,8.731,0,0,1,150.976,181.082Z"
          transform="translate(-124.833 -147.482)"
          fill="#ccc"
        />
        <Ellipse
          id="타원_2"
          data-name="타원 2"
          cx="0.657"
          cy="0.657"
          rx="0.657"
          ry="0.657"
          transform="translate(41.743 17.114)"
          fill="#ccc"
        />
        <Path
          id="패스_63"
          data-name="패스 63"
          d="M399.321,186.575a2.371,2.371,0,1,0,2.371,2.371A2.366,2.366,0,0,0,399.321,186.575Zm0,3.429a1.055,1.055,0,0,1-1.057-1.057,1.057,1.057,0,0,1,2.114,0A1.055,1.055,0,0,1,399.321,190Z"
          transform="translate(-356.921 -171.175)"
          fill="#ccc"
        />
      </G>
    </Svg>
  );
};

export default CameraIcon;
